In [1]:
import os
from dotenv import load_dotenv
import psycopg2
from psycopg2.extras import DictCursor
import pandas as pd

In [2]:
# Function that connects to database
load_dotenv()
def db_connect():
    db_name = os.environ['db_name']
    db_user = os.environ['db_user']
    db_host = os.environ['db_host']
    db_credentials = os.environ['db_creds']
  
    conn_string = "dbname='" + str(db_name) + "' user='" + str(db_user) + "' host='" + str(db_host) + "' password='" + str(db_credentials) + "'"

    try:
        conn = psycopg2.connect(str(conn_string))
        conn.autocommit = True
    except:
        print("Unable to connect to the database")

    cur = conn.cursor(cursor_factory=DictCursor)
    return cur

cur = db_connect()

In [5]:
# Load weather data to DataFrame
query = "SELECT * FROM weather.weather_clean"
cur.execute(query)
results = cur.fetchall()

weather_df = pd.DataFrame(results, columns=['date','tmin','tmax','tavg','prcp','snow','snwd'])
weather_df.head()

         date       tmin       tmax       tavg      prcp      snow      snwd
0  1990-01-01  38.707071  51.352332  45.029701  0.125152  0.011429  7.175000
1  1990-01-02  38.485437  52.512438  45.498937  0.114851  0.017143  5.950000
2  1990-01-03  38.889423  52.830000  45.859712  0.157523  0.028571  6.868085
3  1990-01-04  37.970732  52.688119  45.329425  0.153816  0.040000  7.067391
4  1990-01-05  37.485714  52.746411  45.116063  0.075048  0.034286  6.489362

In [6]:
# Load disaster data to DataFrame
query = "SELECT * FROM weather.disasters_clean"
cur.execute(query)
results = cur.fetchall()

disaster_df = pd.DataFrame(results, columns=['disaster_no','year','country_code','region','disaster_type','deaths','damages'])
disaster_df.head()

,disaster_no,year,country_code,region,disaster_type,deaths,damages
0,1900-0006-JAM,1900,JM,Caribbean,Flood,300.0,NaN
1,1900-9001-IND,1900,IN,Southern Asia,Drought,1250000.0,NaN
2,1900-0008-JPN,1900,JP,Eastern Asia,Volcanic activity,30.0,NaN
3,1900-0003-USA,1900,US,Northern America,Storm,6000.0,30000.0
4,1900-0007-JAM,1900,JM,Caribbean,Epidemic,30.0,NaN